MikroElektronika/core_packages/ARM/gcc_clang/system/src/infineon/cy8c4125lde_hvs/thirdparty/cy8c4125lde_hvs/ip/cyip_sar_v4.h
#define SAR_MUX_SWITCH_CLEAR1_MUX_FW_P5_DFT_INM_Pos 1UL
#define SAR_MUX_SWITCH_CLEAR1_MUX_FW_P5_DFT_INM_Msk 0x2UL
#define SAR_MUX_SWITCH_CLEAR1_MUX_FW_ADFT0_SARBUS0_Pos 2UL
#define SAR_MUX_SWITCH_CLEAR1_MUX_FW_ADFT0_SARBUS0_Msk 0x4UL
#define SAR_MUX_SWITCH_CLEAR1_MUX_FW_ADFT1_SARBUS1_Pos 3UL
#define SAR_MUX_SWITCH_CLEAR1_MUX_FW_ADFT1_SARBUS1_Msk 0x8UL
/* SAR.MUX_SWITCH2 */
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P0_VPLUS_Pos 0UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P0_VPLUS_Msk 0x1UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P1_VPLUS_Pos 1UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P1_VPLUS_Msk 0x2UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P2_VPLUS_Pos 2UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P2_VPLUS_Msk 0x4UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P3_VPLUS_Pos 3UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P3_VPLUS_Msk 0x8UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P4_VPLUS_Pos 4UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P4_VPLUS_Msk 0x10UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P5_VPLUS_Pos 5UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P5_VPLUS_Msk 0x20UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P6_VPLUS_Pos 6UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P6_VPLUS_Msk 0x40UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P7_VPLUS_Pos 7UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P7_VPLUS_Msk 0x80UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P0_VMINUS_Pos 8UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P0_VMINUS_Msk 0x100UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P1_VMINUS_Pos 9UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P1_VMINUS_Msk 0x200UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P2_VMINUS_Pos 10UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P2_VMINUS_Msk 0x400UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P3_VMINUS_Pos 11UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P3_VMINUS_Msk 0x800UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P4_VMINUS_Pos 12UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P4_VMINUS_Msk 0x1000UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P5_VMINUS_Pos 13UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P5_VMINUS_Msk 0x2000UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P6_VMINUS_Pos 14UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P6_VMINUS_Msk 0x4000UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P7_VMINUS_Pos 15UL
#define SAR_MUX_SWITCH2_MUX_FW_EXP_P7_VMINUS_Msk 0x8000UL
#define SAR_MUX_SWITCH2_MUX_FW_VD0_VPLUS_Pos    16UL
#define SAR_MUX_SWITCH2_MUX_FW_VD0_VPLUS_Msk    0x10000UL
#define SAR_MUX_SWITCH2_MUX_FW_VD1_VPLUS_Pos    17UL
#define SAR_MUX_SWITCH2_MUX_FW_VD1_VPLUS_Msk    0x20000UL
#define SAR_MUX_SWITCH2_MUX_FW_VD2_VPLUS_Pos    18UL
#define SAR_MUX_SWITCH2_MUX_FW_VD2_VPLUS_Msk    0x40000UL
#define SAR_MUX_SWITCH2_MUX_FW_VD3_VPLUS_Pos    19UL
#define SAR_MUX_SWITCH2_MUX_FW_VD3_VPLUS_Msk    0x80000UL
#define SAR_MUX_SWITCH2_MUX_FW_VD4_VPLUS_Pos    20UL
#define SAR_MUX_SWITCH2_MUX_FW_VD4_VPLUS_Msk    0x100000UL
#define SAR_MUX_SWITCH2_MUX_FW_VD5_VPLUS_Pos    21UL
#define SAR_MUX_SWITCH2_MUX_FW_VD5_VPLUS_Msk    0x200000UL
#define SAR_MUX_SWITCH2_MUX_FW_VD6_VPLUS_Pos    22UL
#define SAR_MUX_SWITCH2_MUX_FW_VD6_VPLUS_Msk    0x400000UL
#define SAR_MUX_SWITCH2_MUX_FW_VD7_VPLUS_Pos    23UL
#define SAR_MUX_SWITCH2_MUX_FW_VD7_VPLUS_Msk    0x800000UL
#define SAR_MUX_SWITCH2_MUX_FW_VG0_VMINUS_Pos   24UL
#define SAR_MUX_SWITCH2_MUX_FW_VG0_VMINUS_Msk   0x1000000UL
#define SAR_MUX_SWITCH2_MUX_FW_VG1_VMINUS_Pos   25UL
#define SAR_MUX_SWITCH2_MUX_FW_VG1_VMINUS_Msk   0x2000000UL
#define SAR_MUX_SWITCH2_MUX_FW_VG2_VMINUS_Pos   26UL
#define SAR_MUX_SWITCH2_MUX_FW_VG2_VMINUS_Msk   0x4000000UL
#define SAR_MUX_SWITCH2_MUX_FW_VG3_VMINUS_Pos   27UL
#define SAR_MUX_SWITCH2_MUX_FW_VG3_VMINUS_Msk   0x8000000UL
#define SAR_MUX_SWITCH2_MUX_FW_CSRC_VPLUS_Pos   28UL
#define SAR_MUX_SWITCH2_MUX_FW_CSRC_VPLUS_Msk   0x10000000UL
#define SAR_MUX_SWITCH2_MUX_FW_CSINK_VPLUS_Pos  29UL
#define SAR_MUX_SWITCH2_MUX_FW_CSINK_VPLUS_Msk  0x20000000UL
#define SAR_MUX_SWITCH2_MUX_FW_CSRC_VMINUS_Pos  30UL
#define SAR_MUX_SWITCH2_MUX_FW_CSRC_VMINUS_Msk  0x40000000UL
#define SAR_MUX_SWITCH2_MUX_FW_CSINK_VMINUS_Pos 31UL
#define SAR_MUX_SWITCH2_MUX_FW_CSINK_VMINUS_Msk 0x80000000UL
/* SAR.MUX_SWITCH_CLEAR2 */
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P0_VPLUS_Pos 0UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P0_VPLUS_Msk 0x1UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P1_VPLUS_Pos 1UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P1_VPLUS_Msk 0x2UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P2_VPLUS_Pos 2UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P2_VPLUS_Msk 0x4UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P3_VPLUS_Pos 3UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P3_VPLUS_Msk 0x8UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P4_VPLUS_Pos 4UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P4_VPLUS_Msk 0x10UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P5_VPLUS_Pos 5UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P5_VPLUS_Msk 0x20UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P6_VPLUS_Pos 6UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P6_VPLUS_Msk 0x40UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P7_VPLUS_Pos 7UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P7_VPLUS_Msk 0x80UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P0_VMINUS_Pos 8UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P0_VMINUS_Msk 0x100UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P1_VMINUS_Pos 9UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P1_VMINUS_Msk 0x200UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P2_VMINUS_Pos 10UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P2_VMINUS_Msk 0x400UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P3_VMINUS_Pos 11UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P3_VMINUS_Msk 0x800UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P4_VMINUS_Pos 12UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P4_VMINUS_Msk 0x1000UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P5_VMINUS_Pos 13UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P5_VMINUS_Msk 0x2000UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P6_VMINUS_Pos 14UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P6_VMINUS_Msk 0x4000UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P7_VMINUS_Pos 15UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_EXP_P7_VMINUS_Msk 0x8000UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_VD0_VPLUS_Pos 16UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_VD0_VPLUS_Msk 0x10000UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_VD1_VPLUS_Pos 17UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_VD1_VPLUS_Msk 0x20000UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_VD2_VPLUS_Pos 18UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_VD2_VPLUS_Msk 0x40000UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_VD3_VPLUS_Pos 19UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_VD3_VPLUS_Msk 0x80000UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_VD4_VPLUS_Pos 20UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_VD4_VPLUS_Msk 0x100000UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_VD5_VPLUS_Pos 21UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_VD5_VPLUS_Msk 0x200000UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_VD6_VPLUS_Pos 22UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_VD6_VPLUS_Msk 0x400000UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_VD7_VPLUS_Pos 23UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_VD7_VPLUS_Msk 0x800000UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_VG0_VMINUS_Pos 24UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_VG0_VMINUS_Msk 0x1000000UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_VG1_VMINUS_Pos 25UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_VG1_VMINUS_Msk 0x2000000UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_VG2_VMINUS_Pos 26UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_VG2_VMINUS_Msk 0x4000000UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_VG3_VMINUS_Pos 27UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_VG3_VMINUS_Msk 0x8000000UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_CSRC_VPLUS_Pos 28UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_CSRC_VPLUS_Msk 0x10000000UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_CSINK_VPLUS_Pos 29UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_CSINK_VPLUS_Msk 0x20000000UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_CSRC_VMINUS_Pos 30UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_CSRC_VMINUS_Msk 0x40000000UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_CSINK_VMINUS_Pos 31UL
#define SAR_MUX_SWITCH_CLEAR2_MUX_FW_CSINK_VMINUS_Msk 0x80000000UL
/* SAR.MUX_SWITCH_HW_CTRL */
#define SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P0_Pos 0UL
#define SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P0_Msk 0x1UL
#define SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P1_Pos 1UL
#define SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P1_Msk 0x2UL
#define SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P2_Pos 2UL
#define SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P2_Msk 0x4UL
#define SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P3_Pos 3UL
#define SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P3_Msk 0x8UL
#define SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P4_Pos 4UL
#define SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P4_Msk 0x10UL
#define SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P5_Pos 5UL
#define SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P5_Msk 0x20UL
#define SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P6_Pos 6UL
#define SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P6_Msk 0x40UL
#define SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P7_Pos 7UL
#define SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P7_Msk 0x80UL
#define SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_VSSA_Pos 16UL
#define SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_VSSA_Msk 0x10000UL
#define SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_TEMP_Pos 17UL
#define SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_TEMP_Msk 0x20000UL
#define SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_AMUXBUSA_Pos 18UL
#define SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_AMUXBUSA_Msk 0x40000UL
#define SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_AMUXBUSB_Pos 19UL
#define SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_AMUXBUSB_Msk 0x80000UL
#define SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_SARBUS0_Pos 22UL
#define SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_SARBUS0_Msk 0x400000UL
#define SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_SARBUS1_Pos 23UL
#define SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_SARBUS1_Msk 0x800000UL
/* SAR.MUX_SWITCH_HW_CTRL2 */
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_HW_CTRL_EXP_P0_Pos 0UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_HW_CTRL_EXP_P0_Msk 0x1UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_HW_CTRL_EXP_P1_Pos 1UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_HW_CTRL_EXP_P1_Msk 0x2UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_HW_CTRL_EXP_P2_Pos 2UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_HW_CTRL_EXP_P2_Msk 0x4UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_HW_CTRL_EXP_P3_Pos 3UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_HW_CTRL_EXP_P3_Msk 0x8UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_HW_CTRL_EXP_P4_Pos 4UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_HW_CTRL_EXP_P4_Msk 0x10UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_HW_CTRL_EXP_P5_Pos 5UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_HW_CTRL_EXP_P5_Msk 0x20UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_HW_CTRL_EXP_P6_Pos 6UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_HW_CTRL_EXP_P6_Msk 0x40UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_HW_CTRL_EXP_P7_Pos 7UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_HW_CTRL_EXP_P7_Msk 0x80UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_FW_VD0_VG0_Pos 16UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_FW_VD0_VG0_Msk 0x10000UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_FW_VD1_VG1_Pos 17UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_FW_VD1_VG1_Msk 0x20000UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_FW_VD2_VG2_Pos 18UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_FW_VD2_VG2_Msk 0x40000UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_FW_VD3_VG3_Pos 19UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_FW_VD3_VG3_Msk 0x80000UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_FW_VD4_Pos  20UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_FW_VD4_Msk  0x100000UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_FW_VD5_Pos  21UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_FW_VD5_Msk  0x200000UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_FW_VD6_Pos  22UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_FW_VD6_Msk  0x400000UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_FW_VD7_Pos  23UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_FW_VD7_Msk  0x800000UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_FW_CSRC_VPLUS_Pos 28UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_FW_CSRC_VPLUS_Msk 0x10000000UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_FW_CSINK_VPLUS_Pos 29UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_FW_CSINK_VPLUS_Msk 0x20000000UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_FW_CSRC_VMINUS_Pos 30UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_FW_CSRC_VMINUS_Msk 0x40000000UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_FW_CSINK_VMINUS_Pos 31UL
#define SAR_MUX_SWITCH_HW_CTRL2_MUX_FW_CSINK_VMINUS_Msk 0x80000000UL
/* SAR.MUX_SWITCH_STATUS */
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P0_VPLUS_Pos 0UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P0_VPLUS_Msk 0x1UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P1_VPLUS_Pos 1UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P1_VPLUS_Msk 0x2UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P2_VPLUS_Pos 2UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P2_VPLUS_Msk 0x4UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P3_VPLUS_Pos 3UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P3_VPLUS_Msk 0x8UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P4_VPLUS_Pos 4UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P4_VPLUS_Msk 0x10UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P5_VPLUS_Pos 5UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P5_VPLUS_Msk 0x20UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P6_VPLUS_Pos 6UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P6_VPLUS_Msk 0x40UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P7_VPLUS_Pos 7UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P7_VPLUS_Msk 0x80UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P0_VMINUS_Pos 8UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P0_VMINUS_Msk 0x100UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P1_VMINUS_Pos 9UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P1_VMINUS_Msk 0x200UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P2_VMINUS_Pos 10UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P2_VMINUS_Msk 0x400UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P3_VMINUS_Pos 11UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P3_VMINUS_Msk 0x800UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P4_VMINUS_Pos 12UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P4_VMINUS_Msk 0x1000UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P5_VMINUS_Pos 13UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P5_VMINUS_Msk 0x2000UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P6_VMINUS_Pos 14UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P6_VMINUS_Msk 0x4000UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P7_VMINUS_Pos 15UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_P7_VMINUS_Msk 0x8000UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_VSSA_VMINUS_Pos 16UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_VSSA_VMINUS_Msk 0x10000UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_TEMP_VPLUS_Pos 17UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_TEMP_VPLUS_Msk 0x20000UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_AMUXBUSA_VPLUS_Pos 18UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_AMUXBUSA_VPLUS_Msk 0x40000UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_AMUXBUSB_VPLUS_Pos 19UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_AMUXBUSB_VPLUS_Msk 0x80000UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_AMUXBUSA_VMINUS_Pos 20UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_AMUXBUSA_VMINUS_Msk 0x100000UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_AMUXBUSB_VMINUS_Pos 21UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_AMUXBUSB_VMINUS_Msk 0x200000UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_SARBUS0_VPLUS_Pos 22UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_SARBUS0_VPLUS_Msk 0x400000UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_SARBUS1_VPLUS_Pos 23UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_SARBUS1_VPLUS_Msk 0x800000UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_SARBUS0_VMINUS_Pos 24UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_SARBUS0_VMINUS_Msk 0x1000000UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_SARBUS1_VMINUS_Pos 25UL
#define SAR_MUX_SWITCH_STATUS_MUX_FW_SARBUS1_VMINUS_Msk 0x2000000UL
/* SAR.MUX_SWITCH_STATUS2 */
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P0_VPLUS_Pos 0UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P0_VPLUS_Msk 0x1UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P1_VPLUS_Pos 1UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P1_VPLUS_Msk 0x2UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P2_VPLUS_Pos 2UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P2_VPLUS_Msk 0x4UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P3_VPLUS_Pos 3UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P3_VPLUS_Msk 0x8UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P4_VPLUS_Pos 4UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P4_VPLUS_Msk 0x10UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P5_VPLUS_Pos 5UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P5_VPLUS_Msk 0x20UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P6_VPLUS_Pos 6UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P6_VPLUS_Msk 0x40UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P7_VPLUS_Pos 7UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P7_VPLUS_Msk 0x80UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P0_VMINUS_Pos 8UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P0_VMINUS_Msk 0x100UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P1_VMINUS_Pos 9UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P1_VMINUS_Msk 0x200UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P2_VMINUS_Pos 10UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P2_VMINUS_Msk 0x400UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P3_VMINUS_Pos 11UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P3_VMINUS_Msk 0x800UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P4_VMINUS_Pos 12UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P4_VMINUS_Msk 0x1000UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P5_VMINUS_Pos 13UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P5_VMINUS_Msk 0x2000UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P6_VMINUS_Pos 14UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P6_VMINUS_Msk 0x4000UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P7_VMINUS_Pos 15UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_EXP_P7_VMINUS_Msk 0x8000UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_VD0_VPLUS_Pos 16UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_VD0_VPLUS_Msk 0x10000UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_VD1_VPLUS_Pos 17UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_VD1_VPLUS_Msk 0x20000UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_VD2_VPLUS_Pos 18UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_VD2_VPLUS_Msk 0x40000UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_VD3_VPLUS_Pos 19UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_VD3_VPLUS_Msk 0x80000UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_VD4_VPLUS_Pos 20UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_VD4_VPLUS_Msk 0x100000UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_VD5_VPLUS_Pos 21UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_VD5_VPLUS_Msk 0x200000UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_VD6_VPLUS_Pos 22UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_VD6_VPLUS_Msk 0x400000UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_VD7_VPLUS_Pos 23UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_VD7_VPLUS_Msk 0x800000UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_VG0_VMINUS_Pos 24UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_VG0_VMINUS_Msk 0x1000000UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_VG1_VMINUS_Pos 25UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_VG1_VMINUS_Msk 0x2000000UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_VG2_VMINUS_Pos 26UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_VG2_VMINUS_Msk 0x4000000UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_VG3_VMINUS_Pos 27UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_VG3_VMINUS_Msk 0x8000000UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_CSRC_VPLUS_Pos 28UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_CSRC_VPLUS_Msk 0x10000000UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_CSINK_VPLUS_Pos 29UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_CSINK_VPLUS_Msk 0x20000000UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_CSRC_VMINUS_Pos 30UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_CSRC_VMINUS_Msk 0x40000000UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_CSINK_VMINUS_Pos 31UL
#define SAR_MUX_SWITCH_STATUS2_MUX_FW_CSINK_VMINUS_Msk 0x80000000UL
/* SAR.PUMP_CTRL */
#define SAR_PUMP_CTRL_CLOCK_SEL_Pos             0UL
#define SAR_PUMP_CTRL_CLOCK_SEL_Msk             0x1UL
#define SAR_PUMP_CTRL_ENABLED_Pos               31UL
#define SAR_PUMP_CTRL_ENABLED_Msk               0x80000000UL
/* SAR.ANA_TRIM */
#define SAR_ANA_TRIM_CAP_TRIM_Pos               0UL
#define SAR_ANA_TRIM_CAP_TRIM_Msk               0x7UL
#define SAR_ANA_TRIM_TRIMUNIT_Pos               3UL
#define SAR_ANA_TRIM_TRIMUNIT_Msk               0x8UL
/* SAR.WOUNDING */
#define SAR_WOUNDING_WOUND_RESOLUTION_Pos       0UL
#define SAR_WOUNDING_WOUND_RESOLUTION_Msk       0x3UL


#endif /* _CYIP_SAR_V4_H_ */


/* [] END OF FILE */
